RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_syspm_v2.c
cy_en_syspm_hvldo_voltage_t Cy_SysPm_HvLdoGetVoltage(void)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_syspm_hvldo_voltage_t enum.');
    return (cy_en_syspm_hvldo_voltage_t)(_FLD2VAL(SRSS_PWR_HVLDO0_CTL_HVLDO0_VSEL, SRSS_PWR_HVLDO0_CTL));
}


cy_en_syspm_status_t Cy_SysPm_LdoExtraRequester(cy_stc_syspm_extraReq_params_t *extraReqConfig)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_FAIL;

    CY_ASSERT_L2(CY_SYSPM_IS_CORE_BUCK_VOLTAGE_VALID(extraReqConfig->coreBuckVoltSel));

    /* Extra Requester Sequence */

    /* 1. Prevent dynamic setting changes by writing PWR_CBUCK_CTL.CBUCK_PAUSE=1. */
    CY_SYSPM_CORE_BUCK_PAUSE_ENABLE(1U);

    /* 2. Enable PWR_CBUCK_CTL.CBUCK_COPY_SETTINGS */
    SRSS_PWR_CBUCK_CTL2 = _VAL2FLD(SRSS_PWR_CBUCK_CTL2_CBUCK_COPY_SETTINGS, 1UL);

    /* 3. If the intention is to request higher operational state
     * (eg. higher CBUCK target voltage or higher CBUCK mode), load  the
     * desired settings into the extra requester
     * (PWR_CBUCK_CTL.CBUCK_VSEL/MODE). Do not reduce any of the
     * settings, because the intention is that the eventual
     * composite CBUCK mode matches the extra requester
     */
    if(extraReqConfig->coreBuckVoltSel > (uint32_t)Cy_SysPm_CoreBuckGetVoltage())
    {
        (void)Cy_SysPm_CoreBuckSetVoltage((cy_en_syspm_core_buck_voltage_t)extraReqConfig->coreBuckVoltSel);
    }

    if(extraReqConfig->coreBuckMode > (uint32_t)Cy_SysPm_CoreBuckGetMode())
    {
        (void)Cy_SysPm_CoreBuckSetMode((cy_en_syspm_core_buck_mode_t)extraReqConfig->coreBuckMode);
    }

    /* 4. Override the normal harmonization logic which internally selects the
     * scratch profile using PWR_CBUCK_CTL.CBUCK_OVERRIDE).
     */
    SRSS_PWR_CBUCK_CTL2 = _VAL2FLD(SRSS_PWR_CBUCK_CTL2_CBUCK_OVERRIDE, 1UL);

    /* 5. Wait until the status register indicates the transition is completed.
     * See PWR_CBUCK_STATUS.PMU_DONE.
     */
    retVal = Cy_SysPm_CoreBuckStatus();

    if(retVal == CY_SYSPM_SUCCESS)
    {
        /* 6. Update the desired SDR requester.  This is safe to do, because it is
         * not the selected profile and there is no transition in progress, so it
         * will not have any effect on a CBUCK profile.
         */
        Cy_SysPm_SdrConfigure(CY_SYSPM_SDR_0, extraReqConfig->sdr0Config);
        Cy_SysPm_SdrConfigure(CY_SYSPM_SDR_1, extraReqConfig->sdr1Config);

        /* 7. Remove overrides by clearing CBUCK_OVERRIDE and CBUCK_PAUSE */
        SRSS_PWR_CBUCK_CTL2 = _VAL2FLD(SRSS_PWR_CBUCK_CTL2_CBUCK_OVERRIDE, 0UL);
        CY_SYSPM_CORE_BUCK_PAUSE_ENABLE(0U);

        /* 8. Wait until the status register indicates the transition is
         * completed. See PWR_CBUCK_STATUS.PMU_DONE.
         */
        retVal = Cy_SysPm_CoreBuckStatus();
    }

    return retVal;
}


bool Cy_SysPm_RegisterCallback(cy_stc_syspm_callback_t* handler)
{
    bool retVal = false;

    /* Verify the input parameters. */
    if ((handler != NULL) && (handler->callbackParams != NULL) && (handler->callback != NULL))
    {
        uint32_t callbackRootIdx = (uint32_t) handler->type;

        /* If the callback list is not empty. */
        if (pmCallbackRoot[callbackRootIdx] != NULL)
        {
            cy_stc_syspm_callback_t* curCallback = pmCallbackRoot[callbackRootIdx];
            cy_stc_syspm_callback_t* insertPos  = curCallback;

            /* Find the callback after which the new callback is to be
             * inserted. Ensure the given callback has not been registered.
             */
            while ((NULL != curCallback->nextItm) && (curCallback != handler))
            {
                curCallback = curCallback->nextItm;
                /* Callbacks with the same order value are stored in the order
                 * they are registered.
                 */
                if (curCallback->order <= handler->order)
                {
                    insertPos = curCallback;
                }
            }
            /* If the callback has not been registered. */
            if (curCallback != handler)
            {
                /* If the callback is to be inserted at the beginning of the list. */
                if ((insertPos->prevItm == NULL) && (handler->order < insertPos->order))
                {
                    handler->nextItm = insertPos;
                    handler->prevItm = NULL;
                    handler->nextItm->prevItm = handler;
                    pmCallbackRoot[callbackRootIdx] = handler;
                }
                else
                {
                    handler->nextItm = insertPos->nextItm;
                    handler->prevItm = insertPos;

                    /* If the callback is not inserted at the end of the list. */
                    if (handler->nextItm != NULL)
                    {
                        handler->nextItm->prevItm = handler;
                    }
                    insertPos->nextItm = handler;
                }
                retVal = true;
            }
        }
        else
        {
            /* The callback list is empty. */
            pmCallbackRoot[callbackRootIdx] = handler;
            handler->nextItm = NULL;
            handler->prevItm = NULL;
            retVal = true;
        }
    }
    return retVal;
}

bool Cy_SysPm_UnregisterCallback(cy_stc_syspm_callback_t const *handler)
{
    bool retVal = false;

    if (handler != NULL)
    {
        uint32_t callbackRootIdx = (uint32_t) handler->type;
        cy_stc_syspm_callback_t* curCallback = pmCallbackRoot[callbackRootIdx];

        /* Search requested callback item in the linked list */
        while (curCallback != NULL)
        {
            /* Requested callback is found */
            if (curCallback == handler)
            {
                retVal = true;
                break;
            }

            /* Go to next callback item in the linked list */
            curCallback = curCallback->nextItm;
        }

        if (retVal)
        {
            /* Requested callback is first in the list */
            if (pmCallbackRoot[callbackRootIdx] == handler)
            {
                /* Check whether this the only callback registered */
                if (pmCallbackRoot[callbackRootIdx]->nextItm != NULL)
                {
                    pmCallbackRoot[callbackRootIdx] = pmCallbackRoot[callbackRootIdx]->nextItm;
                    pmCallbackRoot[callbackRootIdx]->prevItm = NULL;
                }
                else
                {
                    /* We had only one callback */
                    pmCallbackRoot[callbackRootIdx] = NULL;
                }
            }
            else
            {
                /* Update links of related to unregistered callback items */
                curCallback->prevItm->nextItm = curCallback->nextItm;

                if (curCallback->nextItm != NULL)
                {
                    curCallback->nextItm->prevItm = curCallback->prevItm;
                }
            }
        }
    }

    return retVal;
}

